Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: སྙེམས་པ་ནི་ཐམས་ཅད་དུ་ཡང་དག་པ་མ་ཡིན་པའོ། །དེ་བས་ན་སྙེམས་པ་ཀུན་འབྱུང་བ་ནི་སྡུག་བསྔལ་ཀུན་འབྱུང་བའོ། །སྡུག་བསྔལ་མེད་པ་ནི་འགོག་པའོ། །ཡེ་ཤེས་གང་གིས་སྙེམས་པ་དེ་ལ་མི་སྙེམས་པ་དེ་ནི་ལམ་མོ། །
en: Arrogance is always false; therefore, the origin of arrogance is the origin of suffering, the absence of suffering is cessation, and the wisdom through which arrogance ceases to be arrogance is the path.

source: རིགས་ཀྱི་བུ་བདག་གིས་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདེན་པ་ཤེས་པ་བསྟན་པ་འདིའི་མཐའ་རྟོགས་པར་མི་ནུས་སོ། །
en: “Child of good family, for an eon and more I have not been able to fully realize this teaching on knowing the truth of a bodhisattva.”

source: བདེན་པ་བསྟན་པ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲུག་སྟོང་གིས་བདེན་པ་ཡོངས་སུ་བསྒོམས་པ་ཕྱིར་མི་ལྡོག་པའི་ས་ཁོང་དུ་ཆུད་དོ། །
en: When he finished explaining this teaching on truth, six thousand bodhisattvas realized the state of irreversible cultivation of the truth.

source: བར་སྣང་ལ་གནས་པའི་ལྷའི་བུ་མོ་སྟོང་ཕྲག་བཅུ་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་དང་བྲལ་ཞིང་དྲི་མ་མེད་པ་རྣམ་པར་དག་གོ། །
en: For ten thousand goddesses present in the sky, dust fell away from their Dharma eye that sees phenomena, and they became stainless and pure.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྣམ་པར་གནོན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་དྲན་པ་ཉེ་བར་གཞག་པ་ནི་གང་།
en: The bodhisattva great being Mativikrama then asked the bodhisattva great being Nirārambha, “Child of good family, what is the application of mindfulness?

source: དྲན་པ་ནི་གང་།
en: What is mindfulness?

source: དྲན་པའི་གནས་ནི་གང་། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: What are the modes of mindfulness?”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྣམ་པར་གནོན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་ཐམས་ཅད་ལ་མི་སྐྱེ་བ་ཤེས་པ་དྲན་པ་ཡིན་ནོ། །
en: The bodhisattva great being Nirārambha answered the bodhisattva great being Mativikrama, “Child of good family, for bodhisattvas, mindfulness is knowing that no phenomena arise.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་མི་སྐྱེ་བ་ཤེས་པའི་སྨོན་ལམ་ཅན་ཡིན་ཏེ།
en: Bodhisattvas aspire to know the lack of arising.

source: དེ་དག་གི་དྲན་པ་དེ་ཡང་མི་སྐྱེ་བ་ཤེས་པས་ཡོངས་སུ་སྦྱང་བ་བྱས་པ།
en: Their mindfulness is made pure by knowing the lack of arising.

source: ཐམས་ཅད་དུ་མི་བསྐྱོད་པ། དྲང་བ། མི་གཡོ་བ། གཏིང་དང་འགྲམ་མི་རྟོགས་པ།
en: It is, in all situations, unwavering, direct, unmoving, and recognizes neither the depths nor the shore.

source: འཇིག་རྟེན་པ་དང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཤེས་པར་དཀའ་བ་སྟེ།
en: It is difficult for worldly beings, śrāvakas, and pratyekabuddhas to know.

source: བྱང་ཆུབ་སེམས་དཔའི་དྲན་པ་གང་གིས་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ཀུན་འཛིན་པའི་དྲན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་མངོན་སུམ་མོ། །བྱང་ཆུབ་སེམས་དཔའི་དྲན་པ་དེ་ནི་འདི་འདྲའོ། །བྱང་ཆུབ་སེམས་དཔའི་དྲན་པ་དེའི་གནས་ནི་རྣམ་པ་བཅུ་སྟེ། ལུས་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཚོར་བ་དྲན་པ་ཉེ་བར་གཞག་པ་དང་།
en: The mindfulness of a bodhisattva—which is the mindfulness that fully comprehends the words of all the buddhas—is the immediate experience of the thus-gone, worthy, completely perfect Buddha.

source: སེམས་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཆོས་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་།
en: This is what the mindfulness of a bodhisattva is like.

source: ཆོས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྟེ།
en: “A bodhisattva’s mindfulness has ten modes: (1) the application of mindfulness of the body, (2) the application of mindfulness of sensations, (3) the application of mindfulness of mind, (4) the application of mindfulness of phenomena, (5) the application of mindfulness of recollecting the Buddha, (6) the application of mindfulness of recollecting the Dharma, (7) the application of mindfulness of recollecting the Saṅgha, (8) the application of mindfulness of recollecting discipline, (9) the application of mindfulness of recollecting giving, and (10) the application of mindfulness of recollecting divinities.

source: འདི་དག་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བཅུའོ། །
en: These are the ten applications of mindfulness.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལུས་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན།
en: “What is the bodhisattvas’ application of mindfulness of the body?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་ལུས་འདི་ནི་སྔོན་གྱི་མཐའ་ནས་མ་འོངས། ཕྱི་མའི་མཐར་མི་འཕོ། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ལ་མི་གནས་ཏེ།
en: Bodhisattvas apply mindfulness to the body by thinking as follows: ‘This body did not come from a previous life, it does not migrate to the next life; it was not present in the previous life, and it will not be present in the next life.

source: གཞན་དུ་ན་ཡང་དག་པ་མ་ཡིན་པ། ཕྱིན་ཅི་ལོག་ལས་བྱུང་བ།
en: Otherwise, it would be false, and would arise from error.

source: བྱེད་པ་པོ་དང་ཚོར་བ་པོ་མེད་པ། ཐོག་མ་དང་ཐ་མ་དང་དབུས་མེད་པ།
en: It would be devoid of one who acts and one who feels, and it would have no beginning, no end, and no middle.

source: རྩ་བ་གནས་པ་མེད་པ།
en: There is no fundamental root or governing power.

source: བདག་པོ་མེད་པ། ང་ཡི་བ་མེད་པ། ཡོངས་སུ་འཛིན་པ་མེད་པ་སྟེ། ཚོགས་ཞེས་བྱ་བ་དང་།
en: There is no “mine” and no appropriation.

source: ལུས་ཞེས་བྱ་བ་དང་། ལོངས་སྤྱོད་ཅེས་བྱ་བ་དང་། གནས་ཞེས་བྱ་བ་དང་། རོ་ཞེས་བྱ་བ་དང་། སྐྱེ་མཆེད་ཅེས་བྱ་བ་ནི་གློ་བུར་གྱི་ཐ་སྙད་རྣམས་ཀྱིས་ཐ་སྙད་དུ་བཏགས་པའོ། །
en: Notions of “collection,” “body,” “enjoyment,” “basis,” “corpse,” and “sense base” are conventional designations based on superficial conventions.

source: ལུས་འདི་ནི་སྙིང་པོ་མེད་པ་སྟེ། ཕ་མའི་ཁུ་བ་དང་ཁྲག་ལས་བྱུང་བ།
en: This body is without essence; it comes from the father’s semen and the mother’s blood.

source: མི་གཙང་བ། རུལ་པ། རང་བཞིན་གྱིས་དྲི་མི་ཞིམ་པ།
en: It is innately unclean, putrid, and foul-smelling.

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། འཇིགས་པ་དང་། སྒྱིད་ལུག་པའི་རྐུན་པོས་དཀྲུགས་པ། རྟག་ཏུ་འཇིག་པ།
en: It is confounded by the thieves of desire, anger, dullness, fear, and sloth.

source: འབྲུལ་བ། འབྲལ་བ། རྣམ་པར་འཐོར་བ། རྣམ་པར་འཇོམས་པའི་ཆོས་ཅན། ནད་ཐ་དད་པ་བརྒྱ་སྟོང་གི་ཚང་ངོ་སྙམ་དུ་ལུས་ལ་དྲན་པ་ཉེ་བར་འཇོག་གོ། །
en: It is continuously beset by decay, collapse, disintegration, decomposition, and destruction, and it is host to a hundred thousand different diseases.’

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདི་ལྟར་ལུས་འདི་ནི་རྐང་པ་དང་། རྐང་སོར་དང་། བྱིན་པ་དང་། བརླ་དང་། གྲུ་དོ་དང་། ལྟོ་བ་དང་། ལྟེ་བ་དང་། སྒལ་ཚིགས་དང་། སྙིང་དང་། རྩིབ་ལོགས་དང་། རྩིབ་མ་དང་། ལག་པའི་ཐལ་མོ་དང་། དཔུང་པ་དང་། ཐལ་གོང་དང་། མགྲིན་པ་དང་། འགྲམ་པ་དང་། དཔྲལ་བ་དང་། མགོའི་ཐོད་པ་འདུས་པ་ཙམ་སྟེ།
en: “Furthermore, child of good family, bodhisattvas think about what the body is like and apply mindfulness to the body as follows: ‘This body is just a collection composed of the feet, toes, calves, thighs, sacrum, abdomen, navel, spine, heart, sides, ribs, palms, forearms, shoulders, neck, cheeks, forehead, and skull.

source: ལས་འབྱུང་བའི་བྱེད་པས་བསགས་པ། ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་དང་། ཀུན་ཏུ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་ཐ་དད་པ་བརྒྱ་སྟོང་གི་གནས་སོ། །འདི་ནི་རྫས་མང་པོ་འདུས་པ་འདི་ལྟ་སྟེ། སྐྲ་དང་། སྤུ་དང་། སེན་མོ་དང་།
en: It has been gathered through the impetus of karma’s arising and persists as the hundred thousand different afflictive emotions, secondary afflictive emotions, notions, and concepts.

source: སོ་དང་། རུས་པ་དང་། པགས་པ་དང་། ཤ་དང་། ལུས་དང་། རྒྱུས་པ་དང་། ཚིལ་དང་། ཞག་དང་། ཆུ་སེར་དང་། མཆེར་པ་དང་། གཅིན་དང་། ཕྱི་ས་དང་། ཕོ་བ་དང་། ལོང་ཀ་དང་། ཁྲག་དང་། ངར་སྣབས་དང་། མཁྲིས་པ་དང་། རྣག་དང་། མཆིལ་མ་དང་། ཀླད་པ་དང་།
en: It is a collection of many substances: head hair, body hair, nails, teeth, bone, skin, muscle, marrow, tendons, omentum, fat, serum, liver, urine, feces, stomach, intestines, blood, saliva, bile, pus, mucus, skull, and brain.’

source: ཀླད་རྒྱས་རྣམས་ཏེ། དེ་དེ་ལྟར་རྫས་མང་པོ་འདུས་པ་ཡིན་ནོ། །དེ་ལ་ལུས་ཞེས་ཇི་སྐད་དུ་བྱ་སྙམ་དུ་ལུས་ལ་དྲན་པ་ཉེ་བར་འཇོག་གོ། །དེ་ལ་སོ་སོར་རྟོག་པ་ན་འདི་སྙམ་དུ་སེམས་ཏེ། ལུས་འདི་ནི་ནམ་མཁའ་དང་མཚུངས་སོ་སྙམ་ནས་དེ་ལུས་ལ་ནམ་མཁའ་ལྟར་དྲན་པ་ཉེ་བར་འཇོག་གོ། །
en: “Bodhisattvas analytically think, ‘This body is equal to space,’ and apply mindfulness to the body that is space-like.

source: དེ་ཐམས་ཅད་ནམ་མཁའ་ལྟར་མཐོང་ངོ་། །
en: They see everything as being space-like.

source: དེ་ལུས་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལས་གང་ལ་ཡང་དྲན་པ་མི་འཇུག་གོ། །མི་ལྡོག་གོ། །
en: They neither apply mindfulness to anything apart from that which comprehends the body, nor do they avoid it.

source: མི་འཇུག་མི་ལྡོག་པས་དྲན་པ་ལ་གནས་པ་ཞེས་བྱའོ། །
en: This is known as sustaining mindfulness by neither applying it nor avoiding it.

source: དེ་ལྟར་དྲན་པ་ལ་གནས་པ་ནི་འདི་ལྟར་ལུས་ཇི་ལྟ་བར་བྱང་ཆུབ་ཀྱང་དེ་བཞིན་དུ་ཤེས་ཏེ།
en: To sustain mindfulness in this way is to correctly know that the body accords with awakening.

source: འདི་ལ་ཐོགས་པར་བྱ་བ་མེད་དོ། །
en: There is nothing that obstructs this.

source: གང་དུ་ཐོགས་པ་དེ་ཐམས་ཅད་ནི་ཚུལ་བཞིན་མ་ཡིན་པ་སྟེ།
en: Because anything that obstructs it is not fundamental to it.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: This is what is known as a bodhisattva’s application of mindfulness of the body.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཚོར་བ་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s application of mindfulness of sensations?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། ཚོར་བ་ཞེས་བྱ་བ་ནི་ཁོང་དུ་ཆུད་པ་སྟེ། རེག་པ་དེ་ཡང་ཕྱིན་ཅི་ལོག་པ་དང་། ཕྱིན་ཅི་མ་ལོག་པ་དང་། དེ་གཉི་ག་ལས་རྣམ་པར་གྲོལ་བའོ་སྙམ་མོ། །
en: A bodhisattva thinks, ‘Sensations are something understood; that knowledge is either erroneous, correct, or free of both.’

source: དེ་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་སེམས་གཡེངས་པ་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་རྣམས་ཀྱི་ཚོར་བ་ནི་ཕྱིན་ཅི་ལོག་སྟེ།
en: The sensations of naive, ordinary people, whose minds are distracted and in error, are also in error.

source: དེ་དག་ནི་མི་རྟག་པ་ལ་རྟག་པར་ཚོར་རོ། །སྡུག་བསྔལ་བ་ལ་བདེ་བར་ཚོར་རོ། །བདག་མེད་པ་ལ་བདག་ཏུ་ཚོར་རོ། །མི་གཙང་བ་ལ་གཙང་བར་ཚོར་ཏེ།
en: They experience the impermanent as permanent, suffering as happiness, selflessness as the self, and the impure as pure.

source: འདི་ནི་ཕྱིན་ཅི་ལོག་གི་ཚོར་བའོ། །
en: These are erroneous sensations.

source: གང་མི་རྟག་པ་ལ་མི་རྟག་པར་ཚོར་བ་དང་། སྡུག་བསྔལ་ལ་སྡུག་བསྔལ་དུ་ཚོར་བ་དང་། བདག་མེད་པ་ལ་བདག་མེད་པར་ཚོར་བ་དང་། མི་གཙང་བ་ལ་མི་གཙང་བར་ཚོར་བ་འདི་ནི་ཉན་ཐོས་རྣམས་ཀྱི་ཚོར་བའོ། །
en: Experiencing the impermanent as impermanent, suffering as suffering, selflessness as selflessness, and the impure as impure are the sensations of śrāvakas.

source: གང་མི་རྟག་པ་ལ་མི་རྟག་པ་དང་མི་རྟག་པ་ཡང་མ་ཡིན་པར་ཚོར་བ་དང་། སྡུག་བསྔལ་ལ་སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པར་ཚོར་བ་དང་། བདག་མེད་པ་ལ་བདག་མེད་པ་དང་བདག་མེད་པ་ཡང་མ་ཡིན་པར་ཚོར་བ་དང་། མི་གཙང་བ་ལ་མི་གཙང་བ་དང་མི་གཙང་བ་ཡང་མ་ཡིན་པར་ཚོར་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚོར་བའོ། །
en: Experiencing the impermanent as neither impermanent nor not impermanent, suffering as neither suffering nor happiness, selflessness as neither selfless nor not selfless, and the impure as neither impure nor not impure are the sensations of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་ཚོར་བ་ནི་ཚོར་བ་པོ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་མི་མཐོང་བས་ཚོར་བ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: “A bodhisattva does not recognize an experiencer of these sensations, and in not recognizing one, does not in any way recognize sensations either.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་འདུས་བྱས་ཐམས་ཅད་ནི་ཚོར་བའོ་ཞེས་གསུངས་སོ། །
en: A bodhisattva thinks, ‘The Blessed One said, “All compounded things involve sensation.”

source: གལ་ཏེ་འདུས་བྱས་ཐམས་ཅད་ཚོར་བ་མ་ཡིན་ན་ནི་འདི་ལ་ཚོར་བ་པོ་ཞེས་བྱ་བ་ཅི་ཞིག་ཡོད། ཚོར་བ་ནི་ཚོར་བར་བྱེད་པ་མ་ཡིན། ཚོར་བར་བྱ་བ་དང་། ཚོར་བ་དང་།
en: If all compounded things involve sensation, there would be something referred to as an “experiencer.”

source: ཚོར་བར་བྱེད་པ་མ་ཡིན།
en: Sensations are not the cause of sensations; there is nothing to be sensed, no sensation, and no cause of sensation.

source: འདུས་མ་བྱས་ཀྱང་འདུས་བྱས་ཚོར་བར་བྱེད་པ་མ་ཡིན།
en: Even the uncompounded is not the cause of sensation for the compounded.

source: འདུས་བྱས་དང་འདུས་མ་བྱས་ལས་རྣམ་པར་གྲོལ་བའི་ཚོར་བར་བྱེད་པ་གང་ཡང་མེད་དེ།
en: There is nothing at all that causes sensation that is independent of the compounded and uncompounded.

source: དེ་ལྟར་ཚོར་བ་དེ་དག་ཚོར་བ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: Thus, a bodhisattva recognizes that there is no sensation in any of those sensations.’

source: འདི་ལ་ཚོར་བས་རྩོལ་བ་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: A bodhisattva does not recognize any kind of effort derived through sensation.

source: བྱང་ཆུབ་ཇི་ལྟ་བར་ཚོར་བ་ཡང་དེ་བཞིན་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚོར་བ་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: This correct recognition of how sensation accords with awakening is what is known as a bodhisattva’s application of mindfulness of sensations.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s application of mindfulness of the mind?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཚོར་བ་དེ་ནི་སེམས་ཙམ་མོ། །སེམས་དེ་ཡང་གནས་པ་མེད་པ། གཟུང་བ་མེད་པ། ལུས་མེད་པའོ། །
en: A bodhisattva thinks, ‘A sensation is merely the mind, and that mind has no location, has no grasping, and has no body.

source: གང་གནས་མེད་པ། གཟུང་བ་མེད་པ། ལུས་མེད་པ་དེའི་གནས་ཇི་ལྟ་བུ་ཞིག་ཡོད་སྙམ་མོ། །
en: What would the location be for that which has no status, no grasping, and no body?’

source: སེམས་ཀྱིས་སེམས་མི་ཤེས་སོ། །སེམས་ཀྱིས་སེམས་མི་མཐོང་ངོ་། །གང་ལ་བརྟེན་ནས་བྱུང་བའི་སེམས་དེ་ཡང་གཞན་ལ་རག་ལས་པ། རང་དབང་མེད་པར་མཐོང་ངོ་། །
en: The bodhisattva sees that the mind is not known by the mind, the mind is not seen by the mind, and that a mind that arises on the basis of something is dependent on something other and has no independent agency.

source: སེམས་མ་རྟོགས་པར་བྱང་ཆུབ་ཀྱང་མི་ཤེས་སོ། །
en: Even awakening is not known separately from the mind.

source: དེ་ལ་བྱང་ཆུབ་སེམས་ཙམ་དུ་ཤེས་པས་སེམས་ལ་དབང་ཐོབ་བོ། །དེ་སེམས་ལ་དབང་བས་ཐེག་པ་ཆེན་པོ་ལ་དབང་བྱེད་པ་དང་།
en: By knowing awakening as merely the mind, bodhisattvas attain power over the mind, and through their power over the mind they master the Great Vehicle.

source: སེམས་ཅན་ཐམས་ཅད་ལའང་སེམས་སྙོམས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཡིན་ཏེ།
en: They regard all beings equally and cannot be dissuaded by others from the Great Vehicle.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s application of mindfulness of the mind.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའམ། མི་དགེ་བའམ། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པའམ། ཁ་ན་མ་ཐོ་བ་མེད་པའམ། ཟག་པ་དང་བཅས་པའམ། ཟག་པ་མེད་པའམ།
en: “What is a bodhisattva’s application of mindfulness of phenomena?

source: འཇིག་རྟེན་པའམ། འཇིག་རྟེན་ལས་འདས་པའམ། ཉན་ཐོས་ཀྱི་ཆོས་སམ། རང་སངས་རྒྱས་ཀྱི་ཆོས་སམ། སོ་སོའི་སྐྱེ་བོའི་ཆོས་སམ། ཆོས་གང་དང་གང་ལ་དྲན་པ་ཉེ་བར་འཇོག་པའི་ཆོས་དེ་ཤིན་ཏུ་བཟུང་བ། ཤིན་ཏུ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ། ཤིན་ཏུ་བསགས་པའམ། ཤིན་ཏུ་ཆུབ་པ་རང་གི་ཁ་ན་ལས་པ། ཤིན་ཏུ་དབང་བྱེད་པའི་དྲན་པ་དེས་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་མཉམ་པར་བྱེད་དེ། གང་སྐྱེ་བ་མེད་པ་དང་།
en: Bodhisattvas whose mindfulness has fully comprehended, fully trained in, fully gathered, fully mastered, and taken full independent control over any phenomena to which mindfulness can be applied—virtuous and nonvirtuous, fallible and infallible, defiled and undefiled, mundane and transmundane phenomena, as well as the phenomena of śrāvakas, pratyekabuddhas, and ordinary people—will consider them equal insofar as they do not arise or cease.

source: འགག་པ་མེད་པ་ལས་རྣམ་པར་གྲོལ་བ་དང་། གང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལས་རྣམ་པར་གྲོལ་བ་དང་། གང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལས་རྣམ་པར་གྲོལ་བའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: They do not recognize any phenomenon that transcends being unarisen and unceasing, that transcends dependent arising, or that transcends being empty, signless, and wishless.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཆོས་ཐམས་ཅད་ནི་བདག་པོ་མེད་པ་སྟེ། དབེན་པའི་རང་བཞིན་ཅན།
en: “The bodhisattva thinks, ‘All phenomena lack something that possesses them; they are naturally isolated.

source: ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པ་སྟེ། གཉིས་སུ་མེད་པའི་རང་བཞིན་ཅན།
en: All phenomena lack a self; they are naturally nondual.

source: ཆོས་ཐམས་ཅད་ནི་སྒྲིབ་པ་མེད་པ་སྟེ། ནམ་མཁའི་རང་བཞིན་ཅན།
en: All phenomena are unobscured; they have the nature of space.

source: ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་མི་རྟོག་པ་སྟེ། སེམས་དང་། ཡིད་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དང་བྲལ་བ།
en: All phenomena are nonconceptual; they are free of mind, thought, and the mind consciousness.

source: ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་གྲོལ་བའི་ངོ་བོ་ཉིད་དེ། ཉོན་མོངས་པ་མེད་པའི་རང་བཞིན་ཅན།
en: All phenomena are essentially liberated; they are naturally free of the afflictive emotions.

source: ཆོས་ཐམས་ཅད་ནི་སྨྲ་བ་མེད་པ་སྟེ། བརྗོད་དུ་མེད་པའི་རང་བཞིན་ཅན།
en: All phenomena are indescribable; they are naturally inexpressible.

source: ཆོས་ཐམས་ཅད་ནི་ཡི་གེ་མེད་པ་སྟེ། འདུས་མ་བྱས་པའི་རང་བཞིན་ཅན།
en: All phenomena are inarticulable; they are naturally uncontrived.

source: ཆོས་ཐམས་ཅད་ནི་གྲངས་མེད་པ་སྟེ། གྲངས་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པ།
en: All phenomena are incalculable; they completely transcend all calculations.

source: ཆོས་ཐམས་ཅད་ནི་དྲང་བ་སྟེ། སྤྲོས་པ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པ།
en: All phenomena are straightforward; they completely transcend all conceptual elaborations.

source: ཆོས་ཐམས་ཅད་ནི་ས་བོན་མེད་པའི་ཕྱིར་རྩ་བ་མེད་པ།
en: All phenomena are rootless because they are seedless.

source: ཆོས་ཐམས་ཅད་ནི་རྩ་བ་རྣམ་པར་བྱང་བའི་ཕྱིར་སྐྱོན་མེད་པ།
en: All phenomena are faultless because they are purified at the root.

source: ཆོས་ཐམས་ཅད་ནི་ལུས་མེད་པའི་ཕྱིར་འོང་བ་མེད་པ།
en: No phenomena arrive because they are incorporeal.

source: ཆོས་ཐམས་ཅད་ནི་གནས་པ་མེད་པའི་ཕྱིར་སོང་བ་མེད་པ།
en: No phenomena depart because they are not located anywhere.

source: ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་པའི་ཕྱིར་ཆགས་པ་མེད་པ།
en: All phenomena are unobstructed because they are empty.

source: ཆོས་ཐམས་ཅད་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཕྱིར་སྟོང་པ།
en: All phenomena are empty because they originate dependently.

source: ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་མི་རྟོག་པའི་ཕྱིར་ངེས་པར་འབྱུང་བ།
en: All phenomena escape because they are nonconceptual.

source: ཆོས་ཐམས་ཅད་ནི་ཇི་ལྟར་འདོད་པ་བཞིན་ཁོང་དུ་ཆུད་པའི་ཕྱིར་རང་གི་ཁ་ན་ལས་པ།
en: All phenomena are independent because they are understood in whatever manner is desired.

source: ཆོས་ཐམས་ཅད་ནི་ཤེས་བྱའི་ངོ་བོ་ཉིད་ཀྱི་ཕྱིར་བྱང་ཆུབ་པ།
en: All phenomena are fully realized because they are innately knowable.

source: ཆོས་ཐམས་ཅད་ནི་རྫས་མེད་པའི་ཕྱིར་མིང་ཙམ་པ།
en: All phenomena are mere designations because they are immaterial.

source: ཆོས་ཐམས་ཅད་ནི་བསྟན་དུ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཕྱིར་ལྟ་བ་དང་བྲལ་བ།
en: All phenomena are unobservable because they are innately unsupported.

source: ཆོས་ཐམས་ཅད་ནི་ལུས་མེད་པའི་ཕྱིར་བཅིངས་པ་མེད་པ།
en: All phenomena are unfettered because they are incorporeal.

source: ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར་གྲོལ་བ་མེད་པ།
en: All phenomena are unliberated because they are essenceless.

source: ཆོས་ཐམས་ཅད་ནི་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་ཕྱིར་ཐིབས་པོ་མེད་པ།
en: All phenomena are not impervious because of their essential state of suchness.

source: ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པའི་ཕྱིར་དབྱིངས་གཅིག་པ།
en: All phenomena are of a single scope because of the indivisibility of the expanse of phenomena.

source: ཆོས་ཐམས་ཅད་ནི་ཡང་དག་པའི་མཐའ་དང་མཉམ་པའི་ཕྱིར་ཐ་མི་དད་དོ་སྙམ་དུ་དེ་ལྟར་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ། །
en: And all phenomena are undifferentiated because they are equal to the limit of reality.’ Thinking this, bodhisattvas examine phenomena in this way and sustain that examination.

source: དེ་ལྟར་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་ཐ་དད་དུ་མི་བྱེད།
en: “Bodhisattvas who examine phenomena as such and sustain that examination do not differentiate between beings.

source: ཆོས་ཐ་དད་དུ་མི་བྱེད། ཐེག་པ་ཐ་དད་དུ་མི་བྱེད། སངས་རྒྱས་ཐ་དད་དུ་མི་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཐ་དད་དུ་མི་བྱེད། ཐ་མ་དང་།
en: They do not differentiate between phenomena, vehicles, buddhas, or buddhafields.

source: མཆོག་དང་། བཅིངས་པ་དང་། ཐར་པ་དང་། འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: They do not recognize inferior and superior, bondage and release, or saṃsāra and nirvāṇa.

source: སྤོང་བ་མེད། འཛིན་པ་མེད། འཇུག་པ་མེད། ལྡོག་པ་མེད། ལེན་པ་མེད།
en: They lack abandonment, grasping, engaging, avoiding, accepting, and rejecting.

source: འདོར་བ་མེད་དེ། མི་གཡོ་བ་ཐོབ་ཅིང་གནས་པ་ཡིན་ཏེ།
en: They attain and maintain a state of nondistraction.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བ་ལ་གནས་པ་དེ་སངས་རྒྱས་ཀྱི་ཞིང་ཐ་དད་པ་ན་གནས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གཟིགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་ཏེ།
en: Those bodhisattva great beings who sustain peace will be seen by the blessed buddhas residing in their different buddhafields, and will be prophesied by them to attain unsurpassable, completely perfect awakening.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s application of mindfulness of phenomena.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s application of the mindfulness of recollecting the Buddha?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་སྟེ། སེམས་ཅན་ཐམས་ཅད་མངོན་སུམ་དུ་བྱས་ནས་བདག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆེད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་བསྒྲུབ་བོ། །
en: A bodhisattva’s application of the mindfulness of recollecting the Buddha is to cultivate the following: After bringing all beings immediately to mind, they apply mindfulness with the thought, ‘May I and all beings achieve unsurpassable, completely perfect awakening.

source: འདི་ལྟར་གང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་པོ་དེ་དག་བདག་གིས་བསྒྲུབ་པར་བྱའོ་སྙམ་དུ་དྲན་པ་ཉེ་བར་འཇོག་གོ། །
en: To that end I will achieve the thus-gone, worthy, completely perfect buddhas’ ten strengths of a thus-gone one, four kinds of fearlessness, and eighteen unique qualities.’

source: དྲན་པ་དེས་གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་དྲན་པ་བསམ་གྱིས་མི་ཁྱབ་པ། དྲི་མ་མེད་པ། རྣམ་པར་དག་པ། འོད་གསལ་བ། བག་ལ་ཉལ་མེད་པ། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་ཆད་པ། ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ། ཡེ་ཤེས་ཀྱི་དབང་དུ་གྱུར་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དབང་དུ་གྱུར་པ། ཆོས་ཀྱི་དབང་དུ་གྱུར་པ། ལྷའི་དབང་དུ་གྱུར་པ། ངེས་པར་གྱུར་པ་ཐམས་ཅད་ཐོབ་པ། ཤེས་བྱའི་སྒྲིབ་པའི་དྲི་མ་མེད་པ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་རྟོག་པ། རང་བཞིན་གྱིས་རྣམ་པར་མི་རྟོག་པ། ལྷུན་གྱིས་གྲུབ་པ། མཐུ་སྒྲིབ་པ་མེད་པ། ཐོགས་པ་མེད་པར་གནས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་རྒྱས་པར་བྱེད་པ།
en: Through that mindfulness, bodhisattvas recollect the mindfulness of the blessed buddhas, which is inconceivable, stainless, pure, luminous, and free of latent impressions; in which the entire nexus of habitual patterns has been severed; which is based in wisdom, governed by wisdom, and governed by all the buddhas, the Dharma, and the divine; in which all types of certainty have been obtained; which lacks the stains that obscure objects of knowledge and so cannot be comprehended by śrāvakas and pratyekabuddhas; and which is spontaneously present, of unhindered power, is sustained without obstruction, enhances the thoughts of all beings, and is unchanging like space.

source: ནམ་མཁའ་ལྟར་འགྱུར་བ་མེད་པའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དེ་དག་རྗེས་སུ་དྲན་ནོ། །
en: They recollect the buddhas through these ways of recollection.

source: དྲན་པ་རིན་པོ་ཆེ་སངས་རྒྱས་རྣམས་ཀྱི་ནོར། སངས་རྒྱས་རྣམས་ཀྱི་མཛོད་དེ་དག་རྗེས་སུ་དྲན་ཏེ།
en: They recollect with modes of mindfulness that are the precious jewels of the buddhas, the treasury of the buddhas.

source: དེའི་ཕྱིར་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ཞེས་བྱའོ། །སངས་རྒྱས་དྲན་པ་ཡང་མ་ཡིན།
en: For that reason, this is known as the recollection of the Buddha.
